# Hackerrank
 <strong><em>Java Int to String</strong></em> путь к приложению: https://github.com/Krassilnikov-AV/Hackerrank/blob/master/src/main/java/scaner/Run.java

Вам дано целое число , вам нужно преобразовать его в строку.</p>
Пожалуйста, заполните частично заполненный код в редакторе. Если ваш код успешно конвертируется <em>n</em> в <em>s</em> строку код напечатает « <em>Хорошая работа</em> ». В противном случае будет напечатан «<em>Неверный ответ</em>».</p>
</em>n</em> может варьироваться от 100 к -100  включительно.</p>
Пример ввода:</p>
100</p>
Пример вывода:</p>
Молодец</p>
_ _ _ _ _ 
Задачи наввод и вывод в консоль зачений.</p>
Простейший пример:</p> https://github.com/Krassilnikov-AV/Hackerrank/blob/master/src/main/java/sistemPrintf/Main.java</p>
Функцию Java System.out.printf можно использовать для печати форматированного вывода.</p>
 Цель этого упражнения - проверить ваше понимание форматирования вывода с помощью printf .</p>

Для начала вам предлагается часть решения в редакторе;</p>
вы должны отформатировать и распечатать ввод, чтобы завершить решение.</p>

Формат ввода</p>

Каждая строка ввода будет содержать строку, за которой следует целое число.</p>
Каждая строка будет иметь максимум 10 буквенные символы, и каждое целое число будет находиться в инклюзивном диапазоне от 0 к 999.</p>

Формат вывода</p>

В каждой строке вывода должно быть два столбца:2</p>
первый столбец содержит строку и выровнен по левому краю с использованием точно 15 персонажи.</p>
Второй столбец содержит целое число , выраженное точно вцифры; если исходный ввод содержит менее трех цифр, необходимо дополнить начальные цифры вывода нулями.</p>
Пример ввода</p>

java 100</p>
cpp 65</p>
python 50</p>
Пример вывода</p>

================================</p>
java           100</p>
cpp            065</p>
python         050</p>
================================</p>
 решение по ссылке https://github.com/Krassilnikov-AV/Hackerrank/blob/master/src/main/java/sistemPrintf/Solution.java
 _ _ _ _ _ _ _ _ _ _ _ 
 
Блоки статической инициализации выполняются при загрузке класса, и вы можете инициализировать статические переменные в этих блоках.</p>
Пришло время проверить свои знания о статических блоках инициализации. </p>
Вам предоставляется класс Solution с основным методом. Завершите данный код так, чтобы он выводил площадь параллелограмма шириной и высота . Вы должны прочитать переменные из стандартного ввода.</p>
Если  или B<=0 или H<=0, вывод должен быть «java.lang.Exception: ширина B и высота H должны быть положительными» без кавычек.</p>
Формат ввода</p>
Есть две строки ввода. Первая строка содержит B: ширина параллелограмма. Следующая строка содержит H: высота параллелограмма.</p>
Ограничения</p>
- -100 <= B <=100</p>
- -100 <= H <=100</p>
Формат вывода</p>
Если оба значения больше нуля, то основной метод должен вывести площадь параллелограмма.</p>
 В противном случае выведите «java.lang.Exception: ширина и высота должны быть положительными» без кавычек.</p>
Пример ввода 1</p>

1</p>
3</p>
Пример вывода 1</p>

3</p>
Пример ввода 2</p>

-1</p>
2</p>
Пример вывода 2</p>
https://github.com/Krassilnikov-AV/Hackerrank/tree/master/src/main/java/staticBlock</p>
